In [1]:
import pandas as pd
import numpy as np

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None

In [5]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [6]:
string_data.dropna().reindex()

1    artichoke
3      avocado
dtype: object

In [7]:
from numpy import nan as NA

In [8]:
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [9]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
   ....:                      [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [12]:
cleaned = data.dropna()

In [13]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [14]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [15]:
data[4] = NA

In [16]:
data.dropna(axis=1, how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
df = pd.DataFrame(np.random.randn(7, 3))

In [18]:
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA

In [19]:
df

          0         1         2
0 -0.691019       NaN       NaN
1 -1.189231       NaN       NaN
2  0.268321       NaN -0.293218
3  0.357960       NaN -0.135010
4  0.342511 -0.669741 -0.627657
5  1.472633 -0.247921  1.050236
6  0.551841  0.612580  0.113916

In [20]:
df.dropna()

          0         1         2
4  0.342511 -0.669741 -0.627657
5  1.472633 -0.247921  1.050236
6  0.551841  0.612580  0.113916

In [21]:
df.dropna(thresh=2)

          0         1         2
2  0.268321       NaN -0.293218
3  0.357960       NaN -0.135010
4  0.342511 -0.669741 -0.627657
5  1.472633 -0.247921  1.050236
6  0.551841  0.612580  0.113916

In [22]:
df.iloc[0,0] =NA

In [23]:
df[3] = 4

In [24]:
df

          0         1         2  3
0       NaN       NaN       NaN  4
1 -1.189231       NaN       NaN  4
2  0.268321       NaN -0.293218  4
3  0.357960       NaN -0.135010  4
4  0.342511 -0.669741 -0.627657  4
5  1.472633 -0.247921  1.050236  4
6  0.551841  0.612580  0.113916  4

In [25]:
df.dropna(thresh=2)

          0         1         2  3
1 -1.189231       NaN       NaN  4
2  0.268321       NaN -0.293218  4
3  0.357960       NaN -0.135010  4
4  0.342511 -0.669741 -0.627657  4
5  1.472633 -0.247921  1.050236  4
6  0.551841  0.612580  0.113916  4

In [26]:
df.fillna(0)

          0         1         2  3
0  0.000000  0.000000  0.000000  4
1 -1.189231  0.000000  0.000000  4
2  0.268321  0.000000 -0.293218  4
3  0.357960  0.000000 -0.135010  4
4  0.342511 -0.669741 -0.627657  4
5  1.472633 -0.247921  1.050236  4
6  0.551841  0.612580  0.113916  4

In [27]:
df.fillna({1:0.5, 2:0.3})

          0         1         2  3
0       NaN  0.500000  0.300000  4
1 -1.189231  0.500000  0.300000  4
2  0.268321  0.500000 -0.293218  4
3  0.357960  0.500000 -0.135010  4
4  0.342511 -0.669741 -0.627657  4
5  1.472633 -0.247921  1.050236  4
6  0.551841  0.612580  0.113916  4

In [28]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA

In [29]:
df

          0         1         2
0  3.360773 -0.221953 -1.417451
1  0.219587  1.101714 -0.495945
2  0.866385       NaN -0.157488
3  0.049725       NaN -0.245286
4 -0.525960       NaN       NaN
5 -0.030378       NaN       NaN

In [30]:
# ffill 填充前面值，bfill填充后面值
df.fillna(method="ffill")

          0         1         2
0  3.360773 -0.221953 -1.417451
1  0.219587  1.101714 -0.495945
2  0.866385  1.101714 -0.157488
3  0.049725  1.101714 -0.245286
4 -0.525960  1.101714 -0.245286
5 -0.030378  1.101714 -0.245286

In [31]:
df.fillna(method="ffill", limit=2)

          0         1         2
0  3.360773 -0.221953 -1.417451
1  0.219587  1.101714 -0.495945
2  0.866385  1.101714 -0.157488
3  0.049725  1.101714 -0.245286
4 -0.525960       NaN -0.245286
5 -0.030378       NaN -0.245286

In [32]:
data = pd.Series([1., NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [33]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [34]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
   ....:                      'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [35]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [36]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [37]:
data.drop_duplicates(keep="last")

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
6  two   4

In [38]:
data.drop_duplicates(subset=["k1"])

    k1  k2
0  one   1
1  two   1

In [39]:
data.drop_duplicates(subset=["k1", "k2"],keep="last")

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
6  two   4

In [40]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
   ....:                               'Pastrami', 'corned beef', 'Bacon',
   ....:                               'pastrami', 'honey ham', 'nova lox'],
   ....:                      'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [41]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [42]:
data["food"].str.lower()

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [43]:
data["food"].map(lambda x: x.lower())

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [44]:
data["food"].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [45]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [46]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [47]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [48]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [49]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [50]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
   ....:                     index=['Ohio', 'Colorado', 'New York'],
   ....:                     columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [51]:
data.index.map(lambda x:x.upper())

array(['OHIO', 'COLORADO', 'NEW YORK'], dtype=object)

In [52]:
data.index.map(lambda x: x.title())

array(['Ohio', 'Colorado', 'New York'], dtype=object)

In [53]:
data.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [54]:
data.rename(index={'Ohio': 'INDIANA'},
   ....:             columns={'three': 'peekaboo'})

          one  two  peekaboo  four
INDIANA     0    1         2     3
Colorado    4    5         6     7
New York    8    9        10    11

In [55]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

#### Discretization and Binning

In [56]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]

In [57]:
cats = pd.cut(ages, bins)

In [58]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, object): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [60]:
# similar ont-hot codes
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [61]:
cats.categories

Index([u'(18, 25]', u'(25, 35]', u'(35, 60]', u'(60, 100]'], dtype='object')

In [65]:
cats.value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [66]:
pd.cut(ages, bins, right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, object): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [68]:
pd.cut?